{"q":"How do I impress my professor?","a":"Submit assignments on time. That’s more magical than flowers."}
{"q":"How can I stay awake in class?","a":"Sit in the front row. Fear is better than caffeine."}
{"q":"Best way to take notes?","a":"Write things down. Your brain is not a reliable hard drive during 8am lectures."}
{"q":"How to make friends in college?","a":"Share notes, share snacks, share memes. In that order."}
{"q":"How do I choose electives?","a":"Pick the one with fewer assignments and better Wi-Fi. Follow your heart… and timetable."}
{"q":"How to deal with a strict professor?","a":"Read the rubric. It’s basically the cheat codes they gave you for free."}
{"q":"How can I manage time?","a":"Plan like a CEO, execute like a student: start early, finish before panic mode."}
{"q":"How do I study efficiently?","a":"Pomodoro: 25 mins focus, 5 mins scrolling—uh, stretching. Repeat."}
{"q":"Any tips for group projects?","a":"Assign roles on day one. Otherwise you’ll all be ‘documentation person’ at 2am."}
{"q":"How to prepare for exams?","a":"Past papers + active recall. Guessing the pattern is half the syllabus."}
{"q":"How to impress seniors?","a":"Don’t. Just ask good questions and don’t call them ‘sir/ma’am’ every sentence."}
{"q":"How to get internship?","a":"Projects on GitHub, a clean resume, and LinkedIn stalking—but the professional kind."}
{"q":"What to do if I missed a lecture?","a":"Ask a classmate for notes. Bribe with chocolate if necessary."}
{"q":"Is attendance important?","a":"Only as important as passing. Do the math for your college’s rules."}
{"q":"How to handle backlogs?","a":"Make a two-week rescue plan. One topic per day, no hero speeches."}
{"q":"How to avoid procrastination?","a":"Start an easy task. Momentum beats motivation every time."}
{"q":"Any memory tips?","a":"Teach a friend. If they get it, you’ll remember it. If not, you’ll both cry."}
{"q":"How to talk to a professor?","a":"Be concise, be polite, include your roll number. Professors love organized students."}
{"q":"How to balance coding and classes?","a":"Timebox coding sprints. Don’t debug your life at 3am before lab viva."}
{"q":"How to make a good resume?","a":"One page, measurable impact, links that actually work. No ‘MS Paint - Expert’ please."}
{"q":"How to pick a project idea?","a":"Find a daily annoyance and automate it. Boom—innovation."}
{"q":"How to handle results day stress?","a":"Deep breaths. Your CGPA is a number, not a prophecy."}
{"q":"How to study last minute?","a":"High-yield topics first. Don’t start a Netflix series called ‘Entire Syllabus’."}
{"q":"Is sleeping early necessary?","a":"Only if you like remembering things tomorrow."}
{"q":"How to ask doubts in class?","a":"Ask. Half the class has the same doubt; the other half is on mute."}
{"q":"Any lab exam tips?","a":"Practice the common programs until your fingers type them on autopilot."}
{"q":"How to join clubs?","a":"Attend one meeting. If they give you free stickers, you’ve found your people."}
{"q":"How to network?","a":"Talk to seniors after events. Ask for one tip, not their entire life story."}
{"q":"What to do if I fail an exam?","a":"Regroup, plan a retake strategy, and avoid the ‘I’ll study tomorrow’ trap."}
{"q":"How to handle viva?","a":"Be honest: ‘I don’t know yet—but here’s how I’d find out.’ That line saves lives."}
{"q":"How to save money in college?","a":"Learn the sacred art of canteen combos and split subscriptions."}
{"q":"How to pick a laptop for college?","a":"Battery, keyboard, RAM. Looks are a bonus; not a degree."}
{"q":"How to stay motivated?","a":"Tiny wins daily. Big dreams are built from boring Tuesdays."}
{"q":"How to manage stress?","a":"Move your body, touch sunlight, drink water. Free therapy pack."}
{"q":"Any tips for presentations?","a":"Big fonts, fewer words, one message per slide. No essays on slides, please."}


